app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    @trip = Trip.all

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @trip = Trip.find(params[:id])

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "trips" SET "time" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["time", "tomorrow"], ["updated_at", "2017-06-02 01:33:47.443258"], ["id", 2]]
---
  def update
    @trip = Trip.find(params[:id])
    @trip.update(trip_params)

INSERT INTO "trips" ("location", "time", "travel", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "London"], ["time", "today"], ["travel", "tube"], ["description", "Haha"], ["created_at", "2017-06-02 00:45:23.442183"], ["updated_at", "2017-06-02 00:45:23.442183"]]
---
  def create
    @trip = Trip.new(trip_params)

    @trip.save

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 1]]
---
  def destroy
    @trip = Trip.find(params[:id])
    @trip.destroy